{"keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Model", "config": {"name": "vgg19", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 150, 150, 3]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"filters": 64, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block1_conv1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"filters": 64, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block1_conv2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"name": "block1_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"filters": 128, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block2_conv1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"filters": 128, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block2_conv2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"name": "block2_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1", "config": {"filters": 256, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block3_conv1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2", "config": {"filters": 256, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block3_conv2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3", "config": {"filters": 256, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block3_conv3", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv4", "config": {"filters": 256, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block3_conv4", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool", "config": {"name": "block3_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block4_conv1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block4_conv2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block4_conv3", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv4", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block4_conv4", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool", "config": {"name": "block4_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block5_conv1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block5_conv2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block5_conv3", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv4", "config": {"filters": 512, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "block5_conv4", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool", "config": {"name": "block5_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}}], "output_layers": [["block5_pool", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 13, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_2", "trainable": true}}]}